#####################################
####### R Help Page (共 40 分) #######
#####################################


# 1. (20 分) 請先閱讀 `seq()` 的 help page，
#    再使用此函數產生一個由 `101` 至 `1`、彼此間隔 2 的等差數列，
#    亦即 `101, 99, 97, ..., 3, 1`

# Modify the code below
seq()

# should print out:
#>  [1] 101  99  97  95  93  91 ... 3   1


# 2. (20 分) 請先閱讀 `sum()` 與 `mean()` 的 help page，
#    再使用這些函數計算前一題等差數列的 **總和** 及 **算術平均數** 
#    (hint: 你可能需要使用 **變數** 暫存 `seq()` 產生的等差數列)

# Write your code here


# should print out:
#>  [1] 2601
#>  [1] 51



################################
#### 整個 R Script 的執行結果 ####
###############################
#>  Rscript Q1.R
#>   [1] 101  99  97  95  93  91  89  87  85  83  81  79  77  75  73  71  69  67  65
#>  [20]  63  61  59  57  55  53  51  49  47  45  43  41  39  37  35  33  31  29  27
#>  [39]  25  23  21  19  17  15  13  11   9   7   5   3   1
#>  [1] 2601
#>  [1] 51
